{
  "classifier.predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "Task\nClassify a biomedical paper (title + abstract) into one or more organ-system categories.\n\nInput format\n- A single “paper” with:\n  - Title: <string>\n  - Abstract: <string>\n\nOutput format\n- reasoning: 2–5 concise sentences justifying the labels by citing the paper’s key conditions, organs\/systems, outcomes, or mechanisms.\n- categories: a JSON-like list of lowercase strings (e.g., ['cardiovascular', 'neurological']). Include all applicable categories (multi-label).\n\nAllowed categories\n- 'cardiovascular'\n- 'neurological'\n- 'hepatorenal'\n- Optionally, 'oncology' (use only if the study’s central focus is oncologic; see rules below)\n\nGeneral approach\n1) Use both the title and abstract, prioritizing the abstract if there is any conflict or if the title is vague\/misleading.\n2) Identify the paper’s objective(s), primary outcome(s), and mechanistic focus:\n   - Conditions\/events (e.g., myocardial infarction, stroke, cirrhosis, kidney injury).\n   - Target organ systems (heart\/vasculature, brain\/neuraxis, kidney\/liver).\n   - Interventions\/exposures only insofar as they have organ-specific outcomes (do not infer categories from drug class alone).\n3) Assign every category that is substantively supported by the study’s focus, outcomes, or mechanisms. This is a multi-label task. Favor recall across systems clearly involved, but avoid labels based only on incidental mentions.\n\nCategory mapping rules and signals\n- Cardiovascular:\n  - Heart and systemic vasculature: coronary disease, myocardial infarction, heart failure, arrhythmias, hypertension.\n  - Venous and arterial disease anywhere in the body (peripheral artery disease, deep vein thrombosis, embolism).\n  - Vascular physiology\/metrics (e.g., blood pressure, vascular resistance) when they are outcomes\/mechanistic endpoints.\n  - Do not assign based solely on drug identity (e.g., “beta-blocker,” “statin”) or generic mentions of “heart disease” without concrete cardiovascular outcomes.\n\n- Neurological:\n  - Brain, spinal cord, and peripheral\/autonomic nervous system: stroke, seizures\/epilepsy, encephalopathy, meningitis, focal deficits, autonomic disorders, CNS lesions (e.g., pituitary adenoma when discussed from a CNS perspective).\n  - Mechanistic CNS focus (e.g., neurotransmitters like glutamate\/serotonin in a neurologic framework) supports ‘neurological’.\n  - Important taxonomy note: Papers on inborn errors of metabolism that are classically neurometabolic (e.g., galactosemia\/GALT) should be labeled ‘neurological’ when no other organ-specific outcomes dominate, even if the work is molecular\/enzymatic.\n\n- Hepatorenal:\n  - Kidney or liver involvement, function, or toxicity: changes in creatinine\/eGFR, proteinuria, bilirubin, transaminases (ALT\/AST), cholestasis, cirrhosis, hepatocellular involvement, renal prostanoids.\n  - Either renal or hepatic focus is sufficient.\n  - Do not assign based solely on a metabolic enzyme being hepatic or a disease being “metabolic”; require explicit liver\/kidney outcomes, biomarkers, pathology, or mechanistic focus.\n\n- Oncology:\n  - Assign only if tumor biology, cancer diagnosis\/treatment outcomes, or oncologic mechanisms are central aims\/outcomes.\n  - If cancer is mentioned but the focus is organ-system physiology or non-oncologic outcomes (e.g., renal function in Wilms tumor), prefer the relevant organ-system label(s) without ‘oncology’.\n\nCerebrovascular dual-label rule\n- If the paper’s objectives\/outcomes\/mechanisms address vascular pathology in the brain (ischemic\/hemorrhagic stroke, carotid\/cerebral occlusion, cerebral venous sinus thrombosis):\n  - Assign both ‘neurological’ (neurologic event\/site) and ‘cardiovascular’ (vascular pathology).\n- Do NOT apply dual labels when cerebrovascular terms are incidental or only describe the population without neurologic outcomes being studied.\n\nDisambiguation and edge cases\n- Title vs. abstract: If the title suggests one system but the abstract clearly centers on another (e.g., a title about dementia but an abstract focused on cirrhosis\/hepatocellular or Wilms tumor parameters), follow the abstract and label ‘hepatorenal’, not ‘neurological’.\n- Drug mentions: Hypertension or use of beta-blockers\/statins does not by itself warrant ‘cardiovascular’; require specific CV outcomes or mechanistic endpoints.\n- Mixed-focus papers: Apply ‘cardiovascular’ only when concrete heart\/vascular outcomes are endpoints. If the primary perspective and assessments are CNS (e.g., “neurological perspective,” CNS biomarkers like glutamate\/serotonin, meningitis, pituitary adenoma), prefer ‘neurological’ and omit ‘cardiovascular’ unless CV endpoints are substantive.\n- Neurometabolic disorders: For enzymatic\/genetic metabolic disorders classically associated with neurologic manifestations (e.g., galactosemia\/GALT) where the paper focuses on enzyme function\/assembly without explicit hepatic\/renal outcomes, assign ‘neurological’; do not infer ‘hepatorenal’ solely from hepatic metabolism.\n- Renal tumors and liver disease: Mentions like cirrhosis\/hepatocellular involvement or Wilms tumor parameters support ‘hepatorenal’. Add ‘oncology’ only if the study’s central focus is oncologic (tumor biology\/treatment outcomes).\n\nQuality checklist before finalizing\n- Have you captured all organ systems that are primary outcomes or mechanistic foci (not just the most obvious one)?\n- For cerebrovascular content that is an objective\/outcome\/mechanism, did you include both ‘neurological’ and ‘cardiovascular’? If cerebrovascular terms are incidental or only background, avoid adding ‘neurological’.\n- For renal\/hepatic mechanisms or outcomes (biomarkers like creatinine\/eGFR, ALT\/AST, bilirubin; diagnoses like cirrhosis; renal tumor parameters), did you include ‘hepatorenal’?\n- Did you avoid adding categories based only on incidental mentions, population descriptors, drug identity, or general disease labels without system-specific outcomes?\n\nOutput reminder\n- reasoning: 2–5 sentences linking the title\/abstract to chosen categories.\n- categories: JSON-like list of lowercase strings, e.g., ['cardiovascular', 'hepatorenal'].\n\nIllustrative lessons from prior errors (apply these patterns)\n- Do not label ‘hepatorenal’ for metabolic enzyme papers (e.g., GALT\/galactosemia) unless liver\/kidney outcomes are explicit; such neurometabolic focus maps to ‘neurological’.\n- If the abstract centers on cirrhosis\/hepatocellular involvement or Wilms tumor parameters, assign ‘hepatorenal’ even if the title mentions dementia; omit ‘neurological’ if neurologic outcomes are not actually studied.\n- Do not add ‘cardiovascular’ when heart disease\/statins\/angina are mentioned but the paper’s perspective and endpoints are neurologic (e.g., CNS biomarkers, meningitis, pituitary adenoma) without concrete CV outcomes.",
      "fields": [
        {
          "prefix": "Paper:",
          "description": "Title and abstract of the biomedical paper"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Categories:",
          "description": "List of applicable medical categories for this paper"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.2",
      "cloudpickle": "3.1"
    }
  }
}